# SetDLSeparation

## Description
Sets the Double Line Preferences separation.

```pascal
PROCEDURE SetDLSeparation(separationDistance : REAL);
```

```python
def vs.SetDLSeparation(separationDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|separationDistance|REAL|The separation.|

## Remarks
CJG 6-27-06

## See Also
VS Functions:
GetDLSeparation

## Version
Availability: from VectorWorks12.5

## Category
* Document Settings